services/121-service/src/shared/xml/CreditTransfer.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:cber="http://temenos.com/CBEREMITANCE"
  xmlns:fun="http://temenos.com/FUNDSTRANSFERCBEREMITANCE">
  <soap:Body>
    <cber:RMTFundtransfer>
      <FUNDSTRANSFERCBEREMITANCEType id="">
        <fun:DEBITAMOUNT>1</fun:DEBITAMOUNT>
        <fun:DEBITTHEIRREF>123450216</fun:DEBITTHEIRREF>
        <fun:CREDITTHEIRREF></fun:CREDITTHEIRREF>
        <fun:CREDITACCTNO>1000263499216</fun:CREDITACCTNO>
        <fun:CREDITCURRENCY>ETB</fun:CREDITCURRENCY>
        <fun:CREDITAMOUNT></fun:CREDITAMOUNT>
        <fun:CREDITVALUEDATE></fun:CREDITVALUEDATE>
        <fun:RemitterName>ANDUALE</fun:RemitterName>
        <fun:BeneficiaryName>ABIY</fun:BeneficiaryName>
        <fun:BENCUST></fun:BENCUST>
        <fun:ORDCUST></fun:ORDCUST>
      </FUNDSTRANSFERCBEREMITANCEType>
    </cber:RMTFundtransfer>
  </soap:Body>
</soap:Envelope>
